{
  "Projects": [
    {
      "projectTitle": "CheSudoku",
      "projectImageFile": "Sudoku.jpg",
      "projectDescription": "My current side-project is creating my own personalized sudoku. It was very challenging to develop a worthwhile algorithm for board generation, but with that now in place I'm iterating on the features to make it an ideal experience.",
      "projectLesson": "Start new projects with a working MVP, then refine it. The original algorithm for board generation randomly placed numbers from the first square's top row into the second's middle or bottom and continued as such with placing specific numbers in particular locations randomly. It was bulky and no more accurate than this final version. I found this version when I got to square number 5 and had to take all directions of collisions into account. Extrapolating that provided this nicely succinct result.",
      "projectLinkToGithub": "https://github.com/CheTranqui/PersonalWebsite/tree/main/JSSudoku",
      "projectLinkToYouTube": "https://youtu.be/oib97gNg6a4",
      "projectLinkToSteam": null,
      "projectLinkToDownload": null,
      "projectLinkToGithubIO": null,
      "projectLinkToWebsite": "JSSudoku/sudoku.html"
    },
    {
      "projectTitle": "Java MVC App",
      "projectImageFile": "JavaMVC.jpg",
      "projectDescription": "The original college assignment was simply to create and display a linked-list of students. It expanded to allow the selection of one or multiple students from the original list into a new one for a specific course. I then refactored it to incorporate explicit GUI and Controller classes.",
      "projectLesson": "There is a huge difference between a prototype and a finished product. The conversion from a basic, functioning application to an organized MVC application with appropriate comments. Accomplishing this required additional time and energy, but despite its imperfections, the resultant readability is hugely beneficial.",
      "projectLinkToGithub": "https://github.com/CheTranqui/Registrar-Java-Swing-LinkedList",
      "projectLinkToYouTube": "https://www.youtube.com/watch?v=N5rHHaRTat8",
      "projectLinkToSteam": null,
      "projectLinkToDownload": null,
      "projectLinkToGithubIO": null,
      "projectLinkToWebsite": null
    },
    {
      "projectTitle": "The Martian Tribune",
      "projectImageFile": "MartianTribunePreview.jpg",
      "projectDescription": "<a class='inlineLink' href='https://www.haemimontgames.com/' target='_blank'>Haemimont Games</a> released Surviving Mars back in 2018. I wanted the colonists to feel more personal, so using what I learned in making my drafting minigame I developed my first ever mod: The Martian Tribune. Every third in-game day ('sol') it dynamically presents stories that my team and I wrote depending upon the current state of the game.",
      "projectLesson": "As Project Lead I recruited a second author and later brought on a professional programmer to refactor my original LUA code (what is currently on GitHub is her refactoring). This was an awesome experience in just how challenging, rewarding, and diverse the development experience is when seeing a project through from start to finish.",
      "projectLinkToGithub": "https://github.com/CheTranqui/Surviving-Mars-Martian-Tribune",
      "projectLinkToYouTube": "https://www.youtube.com/watch?v=QJvOHWFPZ_Y&ab_channel=CheTranqui",
      "projectLinkToSteam": "https://steamcommunity.com/sharedfiles/filedetails/?id=1376913896",
      "projectLinkToDownload": null,
      "projectLinkToGithubIO": null,
      "projectLinkToWebsite": null
    },
    {
      "projectTitle": "Estate Management App",
      "projectImageFile": "EstateMgmtPreview.jpg",
      "projectDescription": "In Spring of 2020 my uncle passed away. To assist my father with his estate work I built him a simple website that he could run locally to track his tasks, contacts, goods, and properties. This work forced me to put into practice what I had learned from my informal study via <a class='inlineLink' href='https://www.freecodecamp.org' target='_blank'>freeCodeCamp.org</a> and <a class='inlineLink' href='https://github.com/webdevandres' target='_blank'>a friend's</a> informal mentorship.",
      "projectLesson": "This was my first real experience with DOM manipulation. It uses Local Storage for persistence and it was exciting to use data from one form ('Contacts') to populate the dropdown of another. It was also interesting to work with my dad as my client: the Print page was a result of his desire to access the information while working at the farm or with the Realtor.",
      "projectLinkToGithub": "https://github.com/CheTranqui/Estate-Management",
      "projectLinkToYouTube": "https://youtu.be/jQxiyXLbtPI",
      "projectLinkToSteam": null,
      "projectLinkToDownload": null,
      "projectLinkToGithubIO": "https://chetranqui.github.io/Estate-Management/",
      "projectLinkToWebsite": null
    },
    {
      "projectTitle": "JavaScript Practice Page",
      "projectImageFile": "JavaScriptPreview.jpg",
      "projectDescription": "In the Fall of 2019 I decided to test my resolve and see if I enjoy programming enough to make it a career. <a class='inlineLink' href='https://github.com/webdevandres' target='_blank'>A friend</a> took me on as his mentee, teaching me the basics of front end development as I worked my way through <a class='inlineLink' href='https://www.freecodecamp.org' target='_blank'>freeCodeCamp's</a> coursework. This page is the culmination of my initial introduction to JavaScript.",
      "projectLesson": "I found that I have an aptitude for programming, am able to readily grasp the concepts presented, and that I have the patience and determination to push through the occasional frustration. I enjoy the learning experience and problem solving involved in programming. It is this experience that compelled me to pursue a degree and career in software development.",
      "projectLinkToGithub": null,
      "projectLinkToYouTube": null,
      "projectLinkToSteam": null,
      "projectLinkToDownload": null,
      "projectLinkToGithubIO": null,
      "projectLinkToWebsite": "JSHomework/JSHomework.html"
    }
  ]
}